#!/usr/bin/env bash

IFS=$'\n'
for item in $(cat file_test.txt); do
	echo "$item"
done

:<<////
Разделители полей

Причина вышеописанной особенности заключается в специальной переменной окружения, которая называется `IFS (Internal Field Separator)` и позволяет указывать разделители полей. По умолчанию оболочка bash считает разделителями полей следующие символы:

* Пробел
* Знак табуляции
* Знак перевода строки

Если bash встречает в данных любой из этих символов, он считает, что перед ним — следующее самостоятельное значение списка.

Для того, чтобы решить проблему, можно временно изменить переменную среды `IFS`. Вот как это сделать в bash-скрипте, если исходить из предположения, что в качестве разделителя полей нужен только перевод строки:

```bash
	IFS=$'\n'
```

После добавления этой команды в `bash-скрипт`, он будет работать как надо, игнорируя пробелы и знаки табуляции, считая разделителями полей лишь символы перевода строки.

Разделителями могут быть и другие символы. Например, выше мы выводили на экран содержимое файла `/etc/passwd`. Данные о пользователях в строках разделены с помощью двоеточий. Если в цикле нужно обрабатывать подобные строки, `IFS` можно настроить так:

```bash
	IFS=:
```
////