#!/usr/bin/env bash

for ((i = 0; i < 10; i++)); do
	echo "$i"
done

:<<'END_COMMENT'
# Циклы for в стиле C

Если вы знакомы с языком программирования `C`, синтаксис описания `bash-циклов` for может показаться вам странным, так как привыкли вы, очевидно, к такому описанию циклов:

В bash-скриптах можно использовать циклы `for`, описание которых выглядит очень похожим на циклы в стиле `C`, правда, без некоторых отличий тут не обошлось. Схема цикла при подобном подходе выглядит так:

```bash
	for (( начальное значение переменной ; условие окончания цикла; изменение переменной ))
```

На `bash` это можно написать так:

```bash
	for (( a = 1; a < 10; a++ ))
```
END_COMMENT